app/views/pictures/index.html.erb

<h1>Pictures(<%= @pictures.length %>)</h1>
---
SELECT "pictures".* FROM "pictures"