app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    # render :text => "Saving a picture. URL: #{params[:url]}, Title: #{params[:title]}, Artist: #{params[:artist]}"
    @picture = Picture.new(picture_params)
    if @picture.save

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "pictures" SET "title" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["title", "Back Bob"], ["updated_at", "2015-04-15 20:14:50.483093"], ["id", 6]]
---
  def update
    @picture = Picture.find(params[:id])

    if @picture.update_attributes(picture_params)